meta.viewport=width=device-width, initial-scale=1.0
meta.content-type=text/html; charset=ISO-8859-1
meta.author=Allan de Queiroz
meta.reply-to=allandequeiroz@gmail.com
meta.description=Allan de Queiroz&#39;s Resum&#233;
meta.keywords=Allan, Queiroz, Allan de Queiroz, web, desenvolvimento, development, java, opensource

language-pt=PT
language-en=EN

title=Allan de Queiroz
name=Allan de Queiroz
major=Engenheiro de Software

address=Av Paulista 671 - Ap 1016<br />S&#227;o Paulo - SP, Brasil<br />CEP 01311-100
phone-indicator=T:
phone=+55 11 984170235
email-indicator=E:
email=allandequeiroz@gmail.com
linkedin=http://linkedin.com/in/allandequeiroz
twitter=http://twitter.com/allandequeiroz
wordpress=http://blog.allandequeiroz.com
facebook=
google-plus=
vcard=Informa&#231;&#245;es para contato
pdf=Baixar em PDF

objective=Objetivo
objective-description=Engenharia de Software.

experience=Experi&#234;ncia Profissional

petrobras=Petrobras/Spread, S&#227;o Paulo, Brasil
petrobras-position=Engenheiro de Software
petrobras-period=2012 - Atual
petrobras-pge=Desenvolvimento e evolu&#231;&#227;o do sistema de Pol&#237;tica de Gest&#227;o de Estoque de Petr&#243;leo(PGE-PET) respons&#225;vel pela consolida&#231;&#227;o e cria&#231;&#227;o de proje&#231;&#245;es utilizadas pela &#225;rea de log&#237;stica

puc=PUC-SP, S&#227;o Paulo, Brasil
puc-position=Engenheiro de Software
puc-period=2011 - 2012
puc-cge=Desenvolvimento de sistema para cria&#231;&#227;o, manuten&#231;&#227;o e acompanhamento de contratos de est&#225;gios.
puc-pesq=Desenvolvimento de solu&#231;&#227;o para a concep&#231;&#227;o, manuten&#231;&#227;o e publica&#231;&#227;o dos cat&#225;logos de pesquisas.
puc-baquara=Cruzamento e centraliza&#231;&#227;o de informa&#231;&#245;es em base NoSql(MongoDb) de dados pulverizados entre CNPQ(XML), Base RM(SQLServer) e Base legada(MySql).
puc-ponto=Desenvolvimento de solu&#231;&#227;o de coleta e contabiliza&#231;&#227;o de informa&#231;&#245;es relacionadas a jornada de trabalho dos funcion&#225;rios da universidade.

deal=Deal Technologies
deal-position=Desenvolvedor Java/JEE 1.3, Team Leader
deal-period=2010 - 2011
deal-bot=Redu&#231;&#227;o de 50% da atividade humana no processo de qualifica&#231;&#227;o e distribui&#231;&#227;o de contratos pass&#237;veis de refinanciamento do Banco Votorantim atrav&#233;s da implementa&#231;&#227;o de solu&#231;&#227;o automatizada.
deal-misc=Customiza&#231;&#245;es e expan&#231;&#245;es em diversos sistemas do banco Votorantim.

expertise=Expertise
expertise-position=Desenvolvedor Java/JEE 5
expertise-period=2008 - 2010
expertise-molicar=Desenvolvimento de sistema de consulta, cruzamento e atualiza&#231;&#227;o de informa&#231;&#245;es sobre ve&#237;culos entre Molicar(ws) e Bradesco.
expertise-misc=Customiza&#231;&#245;es e melhorias gerais em sistemas Bradesco.

click=Ag&#234;ncia Click
click-position=Desenvolvedor Java/JEE 5
click-period=2008 - 2008
click-espn=Desenvolvimento do portal ESPN Brasil (ferramentas administrativas, engine de indexa&#231;&#227;o/buscas e cria&#231;&#227;o/edi&#231;&#227;o de conte&#250;do).

avaya=Avaya
avaya-position=Desenvolvedor Java/JEE 1.4
avaya-period=2006 - 2008
avaya-ipapp=Desenvolvimento de diversas solu&#231;&#245;es utilizadas nos telefones IP Avaya, tais como (rss client, push survey, webcam client e exchange).
avaya-eua=Desenvolvimento de sistema de cadastramento de imigrantes do departamento de seguran&#231;a dos EUA.
avaya-delta=Desenvolvimento de sistema de pesquisa (survey) para a compania aerea Delta Air Lines.

mega=Megawork consultoria e sistemas
mega-position=Programador Java
mega-period=2005 - 2006
mega-erp=Customiza&#231;&#245;es e melhorias em ERP open source Compieremw.

education=Educa&#231;&#227;o

uniban=Universidade Bandeirante de S&#227;o Paulo
uniban-as=Bacharelado em Analise de Sistemas
uniban-as-period=2002 - 2005

skills=Conhecimentos

technical=T&#233;cnicos
technical-achitecture=Arquitetura de Software.
technical-software=Java, Ruby, Go, Scala, JavaScript(NodeJS).
technical-frameworks=VRaptor, JSF, Struts, Spring, JPA(Hibernate).
technical-infra=Git, Svn, Cvs, Ant.
technical-ide=Eclipse, Netbeans, IntelliJ, Sublime, VI.
technical-database=MongoDb, Redis, Derby, Mysql, SQL Server, Oracle.
technical-containers=JBoss, Weblogic, Glassfish, Tomcat
technical-os=Linux OS(Debian, RedHat, Ubuntu).

languages=Idiomas
portuguese=Portugu&#234;s - Nativo
english=Ingl&#234;s - Intermedi&#225;rio (Alumni - Leader 2)

certificates=Certifica&#231;&#245;es
scjp=Sun Certified Programmer for the Java Platform, 2007.
scwcd=Sun Certified Web Component Developer for the Java Platform, 2008.
ocpjbcd=Oracle Certified Professional, Java EE 5 Business Component Developer, 2012.
ecmjea=Oracle Certified Master, Java EE Enterprise Architect, 2013.

trainning=Treinamentos
trainning-rr75=Ruby e Rails avan&#231;ados: lidando com problemas do dia a dia, Caelum 2012.
trainning-rr71=Desenvolvimento &#193;gil para Web com Ruby on Rails 3, Caelum 2012.
trainning-fj91=Arquitetura de Sistemas Java, Caelum 2011.
trainning-ejb=Core EJB, Globalcode  2008.
trainning-ajava=Academia do Java, Globalcode 2006.
trainning-pjava=Programador Java, Sun Microsystems  2005.

top=Topo
